/* მოგესალმებით მეგობრებო ეს არის დავალება ნომერი 2. დავალების ყველა ეტაპი აღწერილია კომენტარის სახით
 * 1) შედარება
 * 3) If პირობები
 * 4) ლოგიკური ოპერატორები
 * 5) Switch 
 */



// <------- შედარება ---------#### //

// const num1 = 0;
// const boolean1 = false;
// const num2 = 5;
// const emptyString = "";
// const boolean2 = false;
// const text = "I'm Text";
// const text2 = "0";

// ჩამოწერეთ ცვლადები რომელი არის true რომელი false
// ჩამოწერეთ ზეპირად!
// მაგ. [1, 2, 3, 4]

// >>> კოდი დაწერეთ აქ 

// const isFalse = [boolean1, boolean2];
// const isTrue = [num1, num2, emptyString, text, text2];


//


// შეცვალეთ ერთი ასო რომ მიიღოთ ჭეშმარიტი დებულება
// მოკლედ ახსენით მუშაობის პრინციპი თუ რატომ იმოქმედა

// console.log("abc" > "ab")
// console.log(2 === 004)



// <------- ლოგიკური ოპერატორები ---------#### //

// შეამოწმეთ სრულ წლოვნებაზე და თუ მეტი ან ტოლია
// 18 წელზე შესთავაზეთ სასმელი

// >>> კოდი დაწერეთ აქ 
// let Asaki = Number(prompt("შეიყვანეთ თქვენი ასაკი ციფრებით."))

// if(Asaki > 85){
//   console.log("თქვენ ინებეთ სასმელი, თუმცა დოზა დაარეგურილეთ.")
// }
// else if (Asaki >= 18){
//   console.log("რომელი ბრენდის სასმელი გნებავთ.")
// }
// else if(Asaki < 18){
//   console.log("შენთვის არაალკოჰოლური სასმელთა არმია გვაქვს და ის მიირთვი.")
// }
// else {
//   console.log("გითხარი, რომ ასაკი ციფრებით დაგეწერა.")
// }

//


// მოიფიქრეთ 2 if else-ის მაგალითი თქვენით

// >>> კოდი დაწერეთ აქ

//let Simagle = Number(prompt("შეიყვანეთ თქვენი სიმაღლე ციფრებით."))

// if(Simagle < 177){
//   console.log("თქვენ სამწუხაროდ ჩვენი სამოდელოსთვის დაბალი ხართ.")
// }
// else if(Simagle > 192){
//   console.log("თქვენ ზედმეტად მაღალი ხართ ჩვენი სამოდელოსთვის")
// }
// else if (Simagle >= 177){
//   console.log("მობრძანდით ქასთინგზე დათქმულ დროს.")
// }


// let Sakme = prompt("რას აკეთებდით 2012 წლამდე?")

// if (Sakme == "იმას ვშვრებოდი"){
//   console.log("ბოდიში, მაგრამ ვერ ხართ ნორმალური.")
// }
// else if (Sakme == "ვშრომობდი, როგორც ეხლა"){
//  console.log("კარგია, რომ პროფესიონალი ხართ")
//}
//else {
//   console.log("გილოცავთ, ნორმალური ბრძანდებით")
// }


//


// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ

// Simagle < 177 ? console.log("თქვენ სამწუხაროდ ჩვენი სამოდელოსთვის დაბალი ხართ.") : false;
// Simagle > 192 ? console.log("თქვენ ზედმეტად მაღალი ხართ ჩვენი სამოდელოსთვის.") : false;
// Simagle > 177 && Simagle < 192 ? console.log("მობრძანდით ქასთინგზე დათქმულ დროს.") : false;

//



/*
  ჩვენ გვაქვს ოთხი ფერი რომელთაც აქვთ
  კონკრეტული ციფრები მინიჭებული (თეთრი=4, 
  წითელი=3, მწვანე=2, ლურჯი=1, შავი=0, 
  სხვა ყველა ფერი=undefinde)
*/

// let colorId = 3

// დაწერეთ if ისე, რომ როდესაც ჩვენ
// შევცვლით მაღლა განსაზღვრულ ცვლადს გავიგოთ
// ამ აიდის ფერი (ფერი გამოიტანეთ კონსოლში ტექსტის
// სახით)


// >>> კოდი დაწერეთ აქ

// let colorId = Number(prompt("შეიყვანეთ ციფრი 0-დან 4-მდე"))

// if(colorId == 0){
//   console.log("შავი")
// }
// else if( colorId == 1){
//   console.log("ლურჯი")
// }
// else if (colorId == 2){
//   console.log("მწვანე")
// }
// else if(colorId == 3){
//   console.log("წითელი")
// }
// else if(colorId == 4){
//   console.log("თეთრი")
// }

//



// გადაიყვანეთ If ternary operator-ში მაგ. (true ? 1 : 2) 

// >>> კოდი დაწერეთ აქ

// colorId==0 ? console.log("შავი") : false;
// colorId==1 ? console.log("ლურჯი") : false;
// colorId==2 ? console.log("მწვანე") : false;
// colorId==3 ? console.log("წითელი") : false;
// colorId==4 ? console.log("თეთრი") : false;

//


// <------- დავალება Switch ---------#### //

// ცადეთ იგივე გააკეთოთ რაც წინა დავალებაში
// ოღონდ ამჯერად Switch-ის დახმარებით


// >>> კოდი დაწერეთ აქ

//switch (colorId){
  //   case 0:
  //     console.log("შავი")
  //     break;
  //   case 1:
  //     console.log("ლურჯი")
  //     break
  //   case 2:
  //     console.log("მწვანე") 
  //     break
  //   case 3:
  //     console.log("წითელი")
  //     break
  //   case 4:
  //     console.log("თეთრი")
  //     break       
  //   default:
  //     console.log("0-დან 4-მდე დაწერე")

//



//  ||
//  ||
//  ||
// \  /
//  \/

/*
    ეს დავალება რომ ნახოთ გამოიყენეთ HTML,
    ჩვენი მიზანია ავაწყოთ ჩეთ ბოტი რომელთანაც ვისაუბრებთ
    როგორც ხედავთ დაბლა გამზადებული მაქვს კოდის გარკვეული
    ნაწილი ეს არის ფუნქცია რომელსაც მომავალში გავივლით
    კონკრეტულად ეს ფუნქცია არის რეკურსიული, რეკურსია
    არის პროცესი როდესაც ფუნქცია თავის თავს იძახებს ჩვენ კი
    იმიტომ ვიყენებთ ამას, რომ ყოველ ჯერზე როდესად რაღაცის თქმა
    დაგვჭირდება მზად იყოს სასაუბროდ ჩვენი ბოტი

    // კოდში მოათავსეთ Switch რომლითაც დააპროგნოზებთ სასაუბრო
    // სიტყვებს ააწყობთ მინი ჩათ ბოტს.
    მაგ. 
    """"
      case "გამარჯობა":
        alert("გამარჯობა");
        break;
    """"
*/
 const bot = document.getElementById("bot")


function myFun() {
   let x = prompt("მე მზად არ ვარ პასუხისათვის")

//   // >>> კოდი დაწერეთ აქ გამოიყენეთ Switch
switch (x){
  case "გამარჯობა":
    alert ("გაგიმარჯოს")
    break
    case "როგორ ხარ?":
    alert ("კარგად, თავად?")
    break
    case "რამდენიმე კითხვის დასმა მსურს, შეიძლება?":
    alert ("კი, რატომაც არა?!")
    break
    case "რა გქვია?":
    alert ("კოტე")
    break
    case "რამდენი წლის ხარ?":
    alert ("18")
    break
    case "რა გინდა გამოხვიდე?":
    alert ("რავი, ბევრი რამ, თუმცა პირველ რიგში მინდა, რომ ლუკას და ლოვას დონის სპეციალისტი ვიყო ჩემ საქმიანობაში")
    break
    case "აჰამ, გასაგებია, მოგვიანებით კიდევ შეგეხმიანებით.":
    alert ("კარგი მეგობარო.")
    break
}

//   //

//   // რეკურსიული ფუნქცია
}
